package `module9-interfaces-and-polymorphism`.lesson4

/*
    Полиморфный - способный принимать несколько форм.
    Полиморфизм - возможность работы одних и тех же компонентов с данными разных типов.
    Способность обьектов одноврименно принадлежать разным типам.

    Ad-hoc-полиморфизм - от латинского "полиморфизм по требованию".
    Достигается с помощью:
    - механизма привидения типов
    - механизма перегрузки функции

    Параметрический полиморфизм - возможность функции с одной и той же сигнатурой
    принимать в качестве аргументов данные разных типов и работать с ними.

    Если в качестве параметра выступает базовый класс или интерфейс, то в качестве аргумента
    можно передать экземпляр производного класса или реализацию интерфейса.

    Полиморфность - способность одно обьекта принадлежать разным типам: классам или интерфейса.

 */