package `module7-oop`

/*
     Парадигма - способ мышления, восприятия.

     Инкапсуляция

     - Языковая конструкция, позволяющая связать данные с методами, предназначенными для обработки этих данных
     - Механизм языка, позволяющий ограничить доступ одних компонентов программы к другим

     Для чего нужна инкапсуляция:
     - скрыть от пользователя детали реализации класса
     - предоставить определенные интерфейсы для взаимодействия с классом
     Это обеспечивает:
     - максимально стабильную и прогнозируемую работу программы
     - максимально простое взаимодействие между компонентами


 */