package `module7-oop`

/*
    Наследование - механизм, который позволяет описывать новый класс на основе уже имеющегося,
    взяв за основу все методы и поля этого класса.

    Класс, который взят за онову, называется базовым, родительским, предком или супер классом.

    Класс на его основе называется потомком, наследником, дочерним или производным классом.

    Производный класс обладает всеми теми же свойствоми, что и базовый класс, а так же может
    иметь свои собственные поля и функции.

    Для чего нужно наследование:
    - описывать и создовать иерархии классов, структурировать и систематизировать классы
    - перееиспользовать уже написанный код и избегать ненужного дублирования или копирования кода
    - основа для полиморфизма


 */