package `module8-abstraction`

/*
    Абстракция в ООП - это описание обьекта с использованием только тех характеристик,
    которые с достаточной точностью его представляют.

    Абстрактный класс - базовый, родительский класс, который не предлогает создания экземпляров.
    Он может содержать абстрактные поля и методы, так же обычные поля и методы.
    Если класс наследуется от абстрактного, то он должен реализовать абстрактные члены абстрактного класса,
     либо сам должен быть абстрактным.

     Абстрактная функция - функция, которая не имеет тела. Такая функция может быть обьявлена
     только в абстрактном классе и обязательно должна быть реализована ниже в иерархии.

     Абстрактное поле - поле, которое не имеет значения. Оно может быть обьявлено только в абстрактном классе
     и обязательно должно быть определено ниже в иерархии.

 */